using System;

namespace ConsoleApp2
{
    class Program
    {
        static void Main(string[] args)
        {
            //Создать целочисленную переменную и присвоить ей значение 1
            int a = 1;
            
            //Создать вещественную переменную и присвоить ей любое значение
            double b = 2;
            //Создать не явно типизированную переменную и присвоить ей любое значение
            var c = 32;
            //Вывести на консоль все переменные в строчку 1 методом
            Console.WriteLine(a);
            //5. Возвести в квадрат целочисленную переменную и вывести результат на консоль
            a = 1 * 1;
            Console.WriteLine(a);
            //Принять с консоли 3 числа и перемножить их, результат вывести на консоль
            Console.WriteLine()
        }
    }
}
